examples/01_LIGGGHTSVerificationTests/iii_particlePouringTest/openHFDIB-DEM-Test/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDEMDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bodyNames ( "sphereFalling");

surfaceThreshold    1e-4;
stepDEM     1e-2;
geometricD (1 1 1);
recordSimulation true;
recordFirstTimeStep false;
nSolidsInDomain 10000;

outputSetup
{
    basic false;
    iB  false;
    DEM false;
    addModel false;
    parallelDEM false;
}
DEM
{
    materials
    {
        particle
        {
            Y       5e8;
            nu      0.4;
            mu      0.1;
            adhN    0;
	    	eps     0.6;
        }

        
        wall
        {
            Y       5e8;
            nu      0.4;
            mu      0.1;
            adhN    0;
	    	eps	    0.6;
        }   
    }

    LcCoeff 0.55;
    collisionPatches
    {
		polygonWall0
		{
			material wall;
			nVec (1.0 0.0 0.0);
			planePoint (0.04 0.05 0.0);
		}
		polygonWall1
		{
			material wall;
			nVec (0.0 0.0 1.0);
			planePoint (0.0 0.05 0.04);
		}
		polygonWall2
		{
			material wall;
			nVec (-1.0 0.0 0.0);
			planePoint (-0.04 0.05 0.0);
		}
		polygonWall3
		{
			material wall;
			nVec (0.0 0.0 -1.0);
			planePoint (0.0 0.05 -0.04);
		}
		bot
		{
			material wall;
			nVec (0.0 -1.0 0.0);
			planePoint (0.0 0.0 0.0);
		}
    }
}

sphereFalling
{

	fullyCoupledBody
	{
		velocity (0.0 -1 0.0);
	}
	
	rho         rho [1 -3 0 0 0 0 0] 2500;

	refineMC 5;

	U
	{
		BC  noSlip;
	}

	bodyAddition
	{
		addModel onceScatter;
		onceScatterCoeffs
		{
			addMode fieldBased;
			fieldBasedCoeffs
			{
				fieldName lambda;
				fieldValue 1;
			}
			addDomain boundBox;
			boundBoxCoeffs
			{
				minBound (-0.04 0.2 -0.04);
				maxBound (0.04 0.8 0.04);
			}
			
			scalingMode    noScaling;
			noScalingCoeffs{}
			
			rotationMode   randomRotation;
			randomRotationCoeffs{}
		}
	}
	material particle;
	bodyGeom sphere;
	sphere
	{
	    startPosition   (0.0 0.5 0.0);
	    radius  0.002;
	}
	updateTorque true;
	sdBasedLambda false;
	interfaceSpan 1.0;
	startSynced false;
	refineBuffers 0;
	timesToSetStatic -1;
}
// ************************************************************************* //
